{"Age": [
    "What age-related milestone are you approaching or have recently celebrated, and how did you celebrate it?",
    "Which television shows or movies were popular when you were a teenager?",
    "What life experiences do you consider most defining for your generation?",
    "What were some common trends or fashions during your college years?",
    "At what age did you first use the internet regularly, and what activities did you engage in online?",
    "What age were you when you first experienced a major economic event?",
    "How old were you when you first started using social media, and which platform did you join first?",
    "How did people in your age group typically meet and socialize in their younger years?",
    "What music formats (vinyl, cassettes, CDs, etc.) did you grow up using?",
    "What historical moments do people slightly older than you remember that you just missed?"
],
"Location": [
    "What are the top three universities or colleges in your area?",
    "What is the most visited tourist attraction in your area?",
    "How does the local climate influence your daily activities and lifestyle in your region?",
    "What are the most frequented local cuisines where you live?",
    "What are the main industries driving the economy in your area?",
    "What natural features (mountains, rivers, coast) shape your local landscape?",
    "What local sports teams unite your community?",
    "What's the primary mode of public transportation in your area, if any?",
    "What are the most popular local festivals or events in your area?",
    "How has the demographic makeup of your area changed over the past decade?"
],
"Occupation": [
    "Can you outline your primary responsibilities in your current occupation?",
    "What specific skills are essential for success in your profession?",
    "What does a typical workday look like for you?",
    "How do you stay updated with the latest developments in your industry?",
    "What tools or technologies do you regularly use in your work?",
    "What's the most significant change you've witnessed in your industry?",
    "What emerging trends do you see impacting your profession?",
    "What advice would you give to someone aspiring to enter your field?",
    "Which legislation directly impacts the way you perform your job?",
    "What safety protocols specific to your profession do you follow?"
]}